Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/include/Ifx_MS_FocSolution_F16.h
/**
 *  \brief Check if a clear fault request is pending.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return True if a clear fault request was made but still not processed by the module and
 * False otherwise
 */
static inline bool Ifx_MS_FocSolution_F16_clearFaultIsPending(Ifx_MS_FocSolution_F16* self)
{
    return self->p_clearFault;
}


/**
 *  \brief Set the startup current and the target D current for smooth transition
 *
 *  This API sets the startup current and the transition down target D current as
 *  the product of the transition down D current scaling factor and the startup
 *  current. The target D current is the value to which the D current is ramped up
 *  to before entering the transition down state from the closed loop state.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] startUpCurrentQ15 startup current, greater or equal to 0, normalized by the base current, in Q15
 * format
 */
void Ifx_MS_FocSolution_F16_setStartUpCurrent(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 startUpCurrentQ15);

/**
 *  \brief Get the startup current.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return startup current
 */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getStartUpCurrent(Ifx_MS_FocSolution_F16* self)
{
    return self->param->startUpCurrentQ15;
}


/**
 *  \brief Set the acceleration rate of the speed ramp in open-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] speedRampUpRateOpenLoopQ30 acceleration rate open-loop, greater or equal to zero, represented in Q30
 */
static inline void Ifx_MS_FocSolution_F16_setSpeedRampUpRateOpenLoop(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract32
                                                                     speedRampUpRateOpenLoopQ30)
{
    self->param->speedRampUpRateOpenLoopQ30 = speedRampUpRateOpenLoopQ30;

    if ((self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_openLoop)
        || (self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_transitionUp))
    {
        Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&self->accelerationLimit, speedRampUpRateOpenLoopQ30);
    }
}


/**
 *  \brief Get the acceleration rate of the speed ramp in open-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return acceleration rate open-loop
 */
static inline Ifx_Math_Fract32 Ifx_MS_FocSolution_F16_getSpeedRampUpRateOpenLoop(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedRampUpRateOpenLoopQ30;
}


/**
 *  \brief Set the deceleration rate of the speed ramp in open-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] speedRampDownRateOpenLoopQ30 deceleration rate open-loop, greater or equal to 0, represented in Q30
 */
static inline void Ifx_MS_FocSolution_F16_setSpeedRampDownRateOpenLoop(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract32
                                                                       speedRampDownRateOpenLoopQ30)
{
    self->param->speedRampDownRateOpenLoopQ30 = speedRampDownRateOpenLoopQ30;

    if ((self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_openLoop)
        || (self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_transitionDown))
    {
        Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&self->accelerationLimit, speedRampDownRateOpenLoopQ30);
    }
}


/**
 *  \brief Get the deceleration rate of the speed ramp in open-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return deceleration rate open-loop
 */
static inline Ifx_Math_Fract32 Ifx_MS_FocSolution_F16_getSpeedRampDownRateOpenLoop(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedRampDownRateOpenLoopQ30;
}


/**
 *  \brief Set the acceleration rate of the speed ramp in closed-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] speedRampUpRateClosedLoopQ30 acceleration rate closed-loop, greater or equal to 0, represented in Q30
 */
static inline void Ifx_MS_FocSolution_F16_setSpeedRampUpRateClosedLoop(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract32
                                                                       speedRampUpRateClosedLoopQ30)
{
    self->param->speedRampUpRateClosedLoopQ30 = speedRampUpRateClosedLoopQ30;

    if (self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_closedLoop)
    {
        Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&self->accelerationLimit, speedRampUpRateClosedLoopQ30);
    }
}


/**
 *  \brief Get the acceleration rate of the speed ramp in closed-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return acceleration rate closed-loop
 */
static inline Ifx_Math_Fract32 Ifx_MS_FocSolution_F16_getSpeedRampUpRateClosedLoop(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedRampUpRateClosedLoopQ30;
}


/**
 *  \brief Set the deceleration rate of the speed ramp in closed-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] speedRampDownRateClosedLoopQ30 deceleration rate closed-loop, greater or equal to 0, represented in Q30
 */
static inline void Ifx_MS_FocSolution_F16_setSpeedRampDownRateClosedLoop(Ifx_MS_FocSolution_F16* self,
                                                                         Ifx_Math_Fract32
                                                                         speedRampDownRateClosedLoopQ30)
{
    self->param->speedRampDownRateClosedLoopQ30 = speedRampDownRateClosedLoopQ30;

    if (self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_closedLoop)
    {
        Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&self->accelerationLimit, speedRampDownRateClosedLoopQ30);
    }
}


/**
 *  \brief Get the deceleration rate of the speed ramp in closed-loop, represented in Q30.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return deceleration rate closed-loop
 */
static inline Ifx_Math_Fract32 Ifx_MS_FocSolution_F16_getSpeedRampDownRateClosedLoop(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedRampDownRateClosedLoopQ30;
}


/**
 *  \brief Set the previous value of speed ramp.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] speedRampPreviousValue Previous value of the speed ramp
 */
static inline void Ifx_MS_FocSolution_F16_setSpeedRampPreviousValue(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                    speedRampPreviousValue)
{
    Ifx_Math_AccelLimit_F16_setSpeedStepPreviousValue(&self->accelerationLimit, speedRampPreviousValue);
}


/**
 *  \brief Get the previous value of the speed ramp.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return previous value of the speed ramp
 */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getSpeedRampPreviousValue(Ifx_MS_FocSolution_F16* self)
{
    return Ifx_Math_AccelLimit_F16_getSpeedStepPreviousValue(&self->accelerationLimit);
}


/**
 *  \brief Set the transition down D current scaling factor as well as the target D current
 *
 *  This API sets the internal variable which stores the transition down D current
 *  scaling factor which is the ratio between the target D current for smooth
 *  transition and the startup current. The target D current is the value to which
 *  the D current is ramped up to before entering the transition down state from the
 *  closed loop state. In addition, it also sets the transition down target D
 *  current as the product of the transition down D current scaling factor and the
 *  startup current. The transition down D current scaling factor shall be between 0
 *  and 2-2^(-14), in Q14. If the input parameter is less than zero, then the
 *  internal parameter will be set to zero.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] transitionDownDCurrentScalingQ14 Scaling factor by which the startup current is multiplied to
 * determine the target D current during smooth transition down,
 * between 0 and 2-2^(-14), in Q14
 */
void Ifx_MS_FocSolution_F16_setTransitionDownDCurrentScalingQ14(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                transitionDownDCurrentScalingQ14);

/**
 *  \brief Get the transition down D current scaling factor
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return internal variable transitionDownDCurrentScalingQ14
 */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getTransitionDownDCurrentScalingQ14(
    Ifx_MS_FocSolution_F16* self)
{
    return self->param->transitionDownDCurrentScalingQ14;
}


/**
 *  \brief Set the startup current ramp up rate
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] startUpCurrentRampUpRateQ15 Startup current ramp up rate, greater or equal to 0, in Q15
 */
static inline void Ifx_MS_FocSolution_F16_setStartUpCurrentRampUpRate(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                      startUpCurrentRampUpRateQ15)
{
    /* Initialize startup current up rate configuration */
    self->param->startUpCurrentRampUpRateQ15 = startUpCurrentRampUpRateQ15;

    /* Set rate limiter up rate */
    Ifx_Math_RateLimit_F16_setUpRate(&(self->p_startCurrentRateLimit), self->param->startUpCurrentRampUpRateQ15);
}


/**
 *  \brief Set the transition speed up
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] transitionSpeedUpQ15 Speed threshold to transition from open to closed loop, greater than 0,
 * normalized by the base speed, in Q15
 */
void Ifx_MS_FocSolution_F16_setTransitionSpeedUp(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 transitionSpeedUpQ15);

/**
 *  \brief Set the transition speed band
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] transitionSpeedBandQ15 Difference between up and down transition speeds, greater than 0, normalized by
 * the base speed, in Q15
 */
void Ifx_MS_FocSolution_F16_setTransitionSpeedBand(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                   transitionSpeedBandQ15);

/**
 *  \brief Set the upper limit of the reference current
 *
 *  This API sets the reference current upper limit configuration. Additionally it
 *  sets the upper limit of the output of the speed PI as well as the current
 *  limiter to the same limit.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] refCurrentUpperLimitQ15 Reference current upper limit, normalized by the base current, in Q15
 */
static inline void Ifx_MS_FocSolution_F16_setRefCurrentUpperLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                  refCurrentUpperLimitQ15)
{
    /* Set internal parameter*/
    self->param->refCurrentUpperLimitQ15 = refCurrentUpperLimitQ15;

    /* Set the upper limit of the speed PI */
    Ifx_Math_Pi_F16_setUpperLimit(&(self->speedPi), refCurrentUpperLimitQ15);

    /* Set upper limit of reference current limiter */
    Ifx_Math_Limit_F16_setUpperLimit(&(self->p_refCurrentLimit), refCurrentUpperLimitQ15);
}


/**
 *  \brief Set the lower limit of the reference current
 *
 *  This API sets the reference current lower limit configuration. Additionally it
 *  sets the lower limit of the output of the speed PI as well as the current
 *  limiter to the same limit.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] refCurrentLowerLimitQ15 Reference current lower limit, normalized by the base current, in Q15
 */
static inline void Ifx_MS_FocSolution_F16_setRefCurrentLowerLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                  refCurrentLowerLimitQ15)
{
    /* Set internal parameter*/
    self->param->refCurrentLowerLimitQ15 = refCurrentLowerLimitQ15;

