Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/include/Ifx_MS_FocSolution_F16.h
    /* Set the lower limit of the speed PI */
    Ifx_Math_Pi_F16_setLowerLimit(&(self->speedPi), refCurrentLowerLimitQ15);

    /* Set lower limit of reference current limiter */
    Ifx_Math_Limit_F16_setLowerLimit(&(self->p_refCurrentLimit), refCurrentLowerLimitQ15);
}


/**
 *  \brief Set the proportional gain of the speed PI controller
 *
 *  This function calculates the proportional gain in Q format and value from the
 *  input propGain and sets the proportional gain of the speed PI controller.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] propGain Proportional gain
 */
void Ifx_MS_FocSolution_F16_setSpeedPiPropGain(Ifx_MS_FocSolution_F16* self, uint32_t propGain);

/**
 *  \brief Get the speed PI proportional gain
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return Speed PI proportional gain in unsigned 32-bit format
 */
uint32_t Ifx_MS_FocSolution_F16_getSpeedPiPropGain(Ifx_MS_FocSolution_F16* self);

/**
 *  \brief Set the product of integral gain and sample time of the speed PI controller
 *
 *  This function calculates the product of integral gain and sample time in Q
 *  format and value from the input integGainSamplingTime and sets the gain of the
 *  speed PI controller.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] integGainSamplingTime Product of integral gain and sample time
 */
void Ifx_MS_FocSolution_F16_setSpeedPiIntegGainSamplingTime(Ifx_MS_FocSolution_F16* self, uint32_t
                                                            integGainSamplingTime);

/**
 *  \brief Get the speed PI product of integral gain and sampling time.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return Speed PI product of integral gain and sampling time in unsigned 32-bit format
 */
uint32_t Ifx_MS_FocSolution_F16_getSpeedPiIntegGainSamplingTime(Ifx_MS_FocSolution_F16* self);

/**
 *  \brief Set the upper limit of the reference speed
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] refSpeedUpperLimitQ15 Upper speed limit
 */
void Ifx_MS_FocSolution_F16_setRefSpeedUpperLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                  refSpeedUpperLimitQ15);

/**
 *  \brief Set the lower limit of the reference speed
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \param [in] refSpeedLowerLimitQ15
 */
void Ifx_MS_FocSolution_F16_setRefSpeedLowerLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                  refSpeedLowerLimitQ15);

/**
 *  \brief Get the lower limit of the reference speed
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return refSpeedLowerLimitQ15
 */
Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getRefSpeedLowerLimit(Ifx_MS_FocSolution_F16* self);

/**
 *  \brief Get the upper limit of the reference speed
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 *  \return refSpeedUpperLimitQ15
 */
Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getRefSpeedUpperLimit(Ifx_MS_FocSolution_F16* self);

#endif /*IFX_MS_FOCSOLUTION_F16_H*/
